Res-firecracker-set-v8/firecracker_t_4_c_6_frontVcpu_4_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 4905.035ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 4248.278ms, rate sampling interval: 12304ms
  Thread calibration: mean lat.: 5123.650ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 5073.195ms, rate sampling interval: 17842ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.62s    11.45s   47.05s    81.53%
    Req/Sec   286.30      3.74   293.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.01s 
 75.000%   19.79s 
 90.000%   39.35s 
 99.000%   47.05s 
 99.900%   47.78s 
 99.990%   47.94s 
 99.999%   47.94s 
100.000%   47.94s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5169.151     0.000000            1         1.00
    6787.071     0.100000         5765         1.11
    7544.831     0.200000        11517         1.25
   11591.679     0.300000        17248         1.43
   12353.535     0.400000        23031         1.67
   13008.895     0.500000        28773         2.00
   14516.223     0.550000        31619         2.22
   18464.767     0.600000        34549         2.50
   19021.823     0.650000        37417         2.86
   19398.655     0.700000        40245         3.33
   19791.871     0.750000        43206         4.00
   20070.399     0.775000        44612         4.44
   20463.615     0.800000        46005         5.00
   24936.447     0.825000        47426         5.71
   29982.719     0.850000        48863         6.67
   34668.543     0.875000        50301         8.00
   37060.607     0.887500        51025         8.89
   39354.367     0.900000        51755        10.00
   41779.199     0.912500        52460        11.43
   44040.191     0.925000        53187        13.33
   45023.231     0.937500        53924        16.00
   45318.143     0.943750        54295        17.78
   45547.519     0.950000        54613        20.00
   45842.431     0.956250        55021        22.86
   46039.039     0.962500        55347        26.67
   46268.415     0.968750        55729        32.00
   46366.719     0.971875        55895        35.56
   46465.023     0.975000        56047        40.00
   46596.095     0.978125        56273        45.71
   46694.399     0.981250        56418        53.33
   46825.471     0.984375        56621        64.00
   46891.007     0.985938        56724        71.11
   46956.543     0.987500        56801        80.00
   46989.311     0.989062        56857        91.43
   47054.847     0.990625        56956       106.67
   47153.151     0.992188        57045       128.00
   47218.687     0.992969        57104       142.22
   47251.455     0.993750        57129       160.00
   47316.991     0.994531        57195       182.86
   47349.759     0.995313        57219       213.33
   47448.063     0.996094        57275       256.00
   47480.831     0.996484        57293       284.44
   47513.599     0.996875        57316       320.00
   47546.367     0.997266        57335       365.71
   47579.135     0.997656        57358       426.67
   47611.903     0.998047        57379       512.00
   47644.671     0.998242        57399       568.89
   47644.671     0.998437        57399       640.00
   47677.439     0.998633        57406       731.43
   47742.975     0.998828        57422       853.33
   47775.743     0.999023        57435      1024.00
   47775.743     0.999121        57435      1137.78
   47808.511     0.999219        57442      1280.00
   47841.279     0.999316        57449      1462.86
   47874.047     0.999414        57463      1706.67
   47874.047     0.999512        57463      2048.00
   47874.047     0.999561        57463      2275.56
   47874.047     0.999609        57463      2560.00
   47906.815     0.999658        57472      2925.71
   47906.815     0.999707        57472      3413.33
   47906.815     0.999756        57472      4096.00
   47906.815     0.999780        57472      4551.11
   47939.583     0.999805        57484      5120.00
   47939.583     1.000000        57484          inf
#[Mean    =    17617.761, StdDeviation   =    11449.554]
#[Max     =    47906.816, Total count    =        57484]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  68585 requests in 1.00m, 28.39MB read
Requests/sec:   1143.03
Transfer/sec:    484.50KB